Revit 2027 API
BuiltInFailures.FabricFailures.MajorLapSpliceFailure Property
 The lap splice in the major direction is greater than the half of the overall length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MajorLapSpliceFailure { get; }
Public Shared ReadOnly Property MajorLapSpliceFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MajorLapSpliceFailure {
	FailureDefinitionId^ get ();
}
static member MajorLapSpliceFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace